<!-- terraform-plan -->
### Terraform Plan Preview
This is a preview of the Terraform plan based on the current PR. Note that:
- The plan may change if other PRs are merged before this one
- The plan may differ if this PR is not up to date with master
After this PR is merged, the plan will be regenerated to ensure it's up to date with the latest infrastructure state and a new PR will be automatically created with the updated plan.
```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloud_scheduler_job.culture_cron_scheduler will be created
  + resource "google_cloud_scheduler_job" "culture_cron_scheduler" {
      + description = "Trigger culture cron function at 9:00 AM every weekday"
      + id          = (known after apply)
      + name        = "culture-cron-scheduler"
      + paused      = (known after apply)
      + project     = "khan-internal-services"
      + region      = "us-central1"
      + schedule    = "0 9 * * 1-5"
      + state       = (known after apply)
      + time_zone   = "UTC"

      + pubsub_target {
          + data       = "e30="
          + topic_name = (known after apply)
        }
    }

  # google_cloudfunctions2_function.culture_cron will be created
  + resource "google_cloudfunctions2_function" "culture_cron" {
      + description      = "Culture monitoring and reporting function (runs at 9:00 AM every weekday)"
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + environment      = (known after apply)
      + id               = (known after apply)
      + location         = "us-central1"
      + name             = "culture-cron"
      + project          = "khan-internal-services"
      + state            = (known after apply)
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time      = (known after apply)
      + url              = (known after apply)

      + build_config {
          + build                 = (known after apply)
          + docker_repository     = (known after apply)
          + entry_point           = "main"
          + environment_variables = {
              + "GOOGLE_FUNCTION_SOURCE" = "culture.py"
            }
          + runtime               = "python311"
          + service_account       = (known after apply)

          + automatic_update_policy (known after apply)

          + source {
              + storage_source {
                  + bucket     = "culture-cron-function-khan-internal-services"
                  + generation = (known after apply)
                  + object     = "function-ee633f46de08e825f7be7f83dd51a859.zip"
                }
            }
        }

      + event_trigger {
          + event_type            = "google.cloud.pubsub.topic.v1.messagePublished"
          + pubsub_topic          = (known after apply)
          + retry_policy          = "RETRY_POLICY_RETRY_ON_FAILURE"
          + service_account_email = (known after apply)
          + trigger               = (known after apply)
          + trigger_region        = "us-central1"
        }

      + service_config {
          + all_traffic_on_latest_revision   = true
          + available_cpu                    = (known after apply)
          + available_memory                 = "2048M"
          + environment_variables            = {
              + "SLACK_BOT_TOKEN"  = (sensitive value)
              + "SLACK_CHANNEL_ID" = "#1s-and-0s"
            }
          + gcf_uri                          = (known after apply)
          + ingress_settings                 = "ALLOW_ALL"
          + max_instance_count               = 3
          + max_instance_request_concurrency = (known after apply)
          + min_instance_count               = 0
          + service                          = (known after apply)
          + service_account_email            = (known after apply)
          + timeout_seconds                  = 60
          + uri                              = (known after apply)
        }
    }

  # google_pubsub_topic.culture_cron_topic will be created
  + resource "google_pubsub_topic" "culture_cron_topic" {
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + id               = (known after apply)
      + name             = "culture-cron"
      + project          = "khan-internal-services"
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }

      + message_storage_policy (known after apply)
    }

  # google_secret_manager_secret_iam_member.culture_cron_google_account will be created
  + resource "google_secret_manager_secret_iam_member" "culture_cron_google_account" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:culture-cron@khan-internal-services.iam.gserviceaccount.com"
      + project   = "khan-academy"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "projects/khan-academy/secrets/google_api_service_account__for_alertlib_"
    }

  # google_secret_manager_secret_iam_member.culture_cron_slack_token will be created
  + resource "google_secret_manager_secret_iam_member" "culture_cron_slack_token" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:culture-cron@khan-internal-services.iam.gserviceaccount.com"
      + project   = "khan-academy"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "projects/khan-academy/secrets/Slack__API_token_for_alertlib"
    }

  # google_service_account.culture_cron will be created
  + resource "google_service_account" "culture_cron" {
      + account_id   = "culture-cron"
      + disabled     = false
      + display_name = "Service Account for Culture Cron"
      + email        = "culture-cron@khan-internal-services.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:culture-cron@khan-internal-services.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "khan-internal-services"
      + unique_id    = (known after apply)
    }

  # google_storage_bucket.function_bucket will be created
  + resource "google_storage_bucket" "function_bucket" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "US-CENTRAL1"
      + name                        = "culture-cron-function-khan-internal-services"
      + project                     = "khan-internal-services"
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket_object.function_archive will be created
  + resource "google_storage_bucket_object" "function_archive" {
      + bucket         = "culture-cron-function-khan-internal-services"
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + generation     = (known after apply)
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + md5hexhash     = (known after apply)
      + media_link     = (known after apply)
      + name           = "function-ee633f46de08e825f7be7f83dd51a859.zip"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "./function.zip"
      + storage_class  = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.
```